In [80]:
import numpy as np
import pandas as pd
from pandas import DataFrame
!pip3 install tabula-py
import tabula

Requirement already satisfied: tabula-py in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (2.1.0)
Requirement already satisfied: pandas>=0.25.3 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from tabula-py) (1.0.3)
Requirement already satisfied: numpy in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from tabula-py) (1.18.3)
Requirement already satisfied: distro in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from tabula-py) (1.5.0)
Requirement already satisfied: pytz>=2017.2 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas>=0.25.3->tabula-py) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in /Users/runchentao/Library/Python/3.7/lib/python/site-packages (from pandas>=0.25.3->tabula-py) (2.8.1)
Requirement already satisfied: six>=1.5 in /Users/runchentao/Library/Python/3.7/lib/python/site-packages (from python-dateutil>=2.6.1->pandas>=0.25.3->tabula-py) (1.14.0)
You are using pip version 19.0.3, however version 20.1 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [81]:
def listToString(s):  
    # initialize an empty string 
    str1 = ""  
    
    # traverse in the string   
    for ele in s:  
        str1 += ele   
    
    # return string   
    return str1  

# Define the file path of bank statement
filepath = "/Users/runchentao/Desktop/bank_statement.pdf"

# Read transcation table using tabula
data = tabula.read_pdf(filepath,pages='all', multiple_tables=True, pandas_options={'header': None})

# Combine tables from different pages if necessary
df = pd.concat(data)
df

            0            1               2         3        4         5
0        DATE  PARTICULARS            Memo  WITHDRAW  DEPOSIT   BALANCE
1    1-Jan-19    Chase ATM  ATM Withdrawal       100        0    319.08
2    1-Jan-19    Chase ATM  ATM Withdrawal       100        0    219.08
3    1-Jan-19    Chase ATM  ATM Withdrawal       100        0    119.08
4    1-Jan-19    Chase ATM  ATM Withdrawal       100        0     19.08
..        ...          ...             ...       ...      ...       ...
33  23-Jan-19    Chase ATM     ATM Deposit         0   100.00  5,400.00
34  23-Jan-19    Chase ATM     ATM Deposit         0   100.00  5,500.00
35  23-Jan-19    Chase ATM     ATM Deposit         0   100.00  5,600.00
36  23-Jan-19    Chase ATM     ATM Deposit         0   100.00  5,700.00
37  23-Jan-19    Chase ATM     ATM Deposit         0   100.00  5,800.00

[61 rows x 6 columns]

In [77]:
# Drop null values and fill with blank in the table
df.dropna (how = 'all', inplace = True)
df.fillna("", inplace= True)
df

            0            1               2         3        4         5
0        DATE  PARTICULARS            Memo  WITHDRAW  DEPOSIT   BALANCE
1    1-Jan-19    Chase ATM  ATM Withdrawal       100        0    319.08
2    1-Jan-19    Chase ATM  ATM Withdrawal       100        0    219.08
3    1-Jan-19    Chase ATM  ATM Withdrawal       100        0    119.08
4    1-Jan-19    Chase ATM  ATM Withdrawal       100        0     19.08
..        ...          ...             ...       ...      ...       ...
33  23-Jan-19    Chase ATM     ATM Deposit         0   100.00  5,400.00
34  23-Jan-19    Chase ATM     ATM Deposit         0   100.00  5,500.00
35  23-Jan-19    Chase ATM     ATM Deposit         0   100.00  5,600.00
36  23-Jan-19    Chase ATM     ATM Deposit         0   100.00  5,700.00
37  23-Jan-19    Chase ATM     ATM Deposit         0   100.00  5,800.00

[61 rows x 6 columns]

In [78]:
# Size of the table
df.size

366

In [79]:
# Export into csv file for next step
df.to_csv('classification_input.csv')